eisup_2019_docmng_integration/src/DataProcessors/ПомощникПодготовкиУведомленияОКонтролируемыхСделках/ПомощникПодготовкиУведомленияОКонтролируемыхСделках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникПодготовкиУведомленияОКонтролируемыхСделках</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

eisup_2019_docmng_integration/src/Documents/КонтролируемаяСделка/КонтролируемаяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтролируемаяСделка</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеОКонтролируемойСделке</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВзаимозависимости</name>
    <type>
      <types>EnumRef.ТипыВзаимозависимости</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСделки</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>CatalogRef.НематериальныеАктивы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредметаСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Строка121СтороныВзаимозависимыПоКодексу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка122СделкаВОбластиВнешнейТорговли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка123СделкаСКонтрагентомСЛьготнымНалогообложением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка124СделкаСНезависимымПосредником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка131СуммаДоходовПоСделкамПревышаетПредел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка132СделкаСПлательщикомНДПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка133СделкаСКонтрагентомНаСпецрежимах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка134СделкаСПлательщикомНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка135СделкаСРезидентомОЭЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНаименованияСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСтороныСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияЦеныСделки</name>
    <type>
      <types>CatalogRef.СпособыОпределенияЦенКонтролируемыхСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКПункту7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоходовРегулируемых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходовРегулируемых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредметаСделки</name>
    <type>
      <types>EnumRef.ТипыПредметовКонтролируемыхСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхожденияПредметаСделки</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСделки</name>
    <type>
      <types>EnumRef.ТипыКонтролируемыхСделок</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьСуммыСделок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяемаяМетодикаДляТрансфертногоЦенообразования</name>
    <type>
      <types>CatalogRef.абс_МетодикиДляТрансфертногоЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияФилиал</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаОднородныхСделок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сделки</name>
    <attributes>
      <name>ДатаСовершенияСделки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУсловийПоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаОтправкиТовара</name>
      <type>
        <types>CatalogRef.КлассификаторСтранМира</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРегионаОтправкиТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГородОтправкиТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаселенныйПунктОтправкиТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаСовершенияСделки</name>
      <type>
        <types>CatalogRef.КлассификаторСтранМира</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРегионаСовершенияСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГородСовершенияСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаселенныйПунктСовершенияСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодОКВЭД</name>
      <type>
        <types>CatalogRef.абс_ОКВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/DataProcessors/ПомощникПодготовкиУведомленияОКонтролируемыхСделках/Forms/ФормаУведомления/Module.bsl
&НаКлиенте
Перем ТЗ;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

&НаСервере
Процедура ЗаполнитьСписокУведомлений(ТЗ)
	
	// {{ТТК Сладков А. Заявка № 31.05.2016 начало
	//СхемаКомпоновкиДанных = Обработки.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.ПолучитьМакет("Макет");            
	СхемаКомпоновкиДанных=РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет"); 
	// }}ТТК Сладков А. Заявка № 31.05.2016 окончание
	
	// Компоновка макета компоновки данных.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);

	// Заполнение параметров с полей отбора компоновщика настроек формы обработки.
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ВидОтображения", ВидОтображения);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(Дата(ОтчетныйГод, 1, 1)));
	
	// {{ТТК Сладков А. Заявка № 31.05.2016 начало
	Запрос.УстановитьПараметр("ТипУведомления", ЭтаФОрма.ТипУведомления);
	// }}ТТК Сладков А. Заявка № 31.05.2016 окончание

	ТЗ1 = Запрос.Выполнить().Выгрузить();
	ТЗ = ТЗ1.Скопировать();
	
	Листы1Б.Очистить();
	Если ТЗ1.Количество() > 0 Тогда
		Строки  = ТЗ1.НайтиСтроки(Новый Структура("Ссылка",ТЗ1[0].Ссылка));
		Для каждого Стр Из Строки Цикл
			НС = Листы1Б.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Стр);
		КонецЦикла;
	КонецЕсли;
	
	
	Если ВидОтображения1 = 0 Тогда
		ТЗ1.Свернуть("Ссылка,КодНаименованияСделки,КодСтраныПроисхождения,КоличествоУчастниковСделки,ОтноситсяКГруппеОднородныхСделок,СпособОпределенияЦенКонтролируемыхСделок,КодОснованияОтнесенияСделки,ПрименяемаяМетодикаДляТрансфертногоЦенообразования,ОсобенностиОтнесенияСделкиККонтролируемой,КодСтороныСделки,СуммаДоходов,СуммаРасходов",);
		Уведомления.Загрузить(ТЗ1);
	Иначе
		УведомленияОбщийСписок.Загрузить(ТЗ1);
	КонецЕсли;
	
	ИтогоДоходы  = Уведомления.Итог("СуммаДоходов");
	ИтогоРасходы = Уведомления.Итог("СуммаРасходов");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ 

&НаКлиенте
Процедура УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	Если ТекущиеДанные <>  Неопределено Тогда
		Если Поле.Имя = "УведомленияДоговорКонтрагента" Тогда
			Если ЗначениеЗаполнено(Элементы.Уведомления.ТекущиеДанные.ДоговорКонтрагента) Тогда	
				Форма = Элементы.Уведомления.ТекущиеДанные.ДоговорКонтрагента.ПолучитьФорму();
				Форма.Открыть();
			КонецЕсли;	
		Иначе	
			Форма = Элементы.Уведомления.ТекущиеДанные.Ссылка.ПолучитьФорму();
			Форма.Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура УведомленияПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Уведомления.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Строки = ТЗ.НайтиСтроки(Новый Структура("Ссылка",ТекущиеДанные.Ссылка));
		
		Листы1Б.Очистить();
		Для каждого Стр Из Строки Цикл
			НС = Листы1Б.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Стр);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОтображенияПриИзменении(Элемент)
	ЗаполнитьСписокУведомлений(ТЗ);
КонецПроцедуры

 &НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
 
	СхемаКомпоновкиДанных = Обработки.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.ПолучитьМакет("Макет");            
	
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию(); 
//	Листы1Б.Параметры.УстановитьЗначениеПараметра("Ссылка",Документы.КонтролируемаяСделка.ПустаяСсылка());
	ОтчетныйГод 	= Параметры.ОтчетныйГод;
	Организация	 	= Параметры.Организация;
	// {{ТТК Сладков А. Заявка № 31.05.2016 начало
	ТипУведомления 	= Параметры.ТипУведомления;
	// }}ТТК Сладков А. Заявка № 31.05.2016 окончание
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетныйГодПриИзменении(Элемент)
	ЗаполнитьСписокУведомлений(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомление(Команда)
	ОткрытьФорму("Документ.КонтролируемаяСделка.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьСписокУведомлений(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокУведомлений(ТЗ);
	 ИзменитьВидОтчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНастройки(Команда)
	Если Элементы.КомпоновщикНастроекКомпоновкиДанныхПользовательскиеНастройки.Видимость Тогда
		Элементы.ПоказатьНастройки.Заголовок = "Показать настройки";	
	Иначе
		Элементы.ПоказатьНастройки.Заголовок = "Скрыть настройки";	
	КонецЕсли;
	
	Элементы.КомпоновщикНастроекКомпоновкиДанныхПользовательскиеНастройки.Видимость = Не Элементы.КомпоновщикНастроекКомпоновкиДанныхПользовательскиеНастройки.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура Листы1БВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Листы1БДоговорКонтрагента" Тогда
	
		Договор = Элемент.ТекущиеДанные.ДоговорКонтрагента.ПолучитьФорму();
		Договор.Открыть();
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидОтчета()

	Если ВидОтображения1 = 0 Тогда
		Элементы.Группа1.Видимость = Истина;
		Элементы.Группа2.Видимость = Истина;
		Элементы.УведомленияОбщийСписок.Видимость = Ложь;
	Иначе	
		Элементы.Группа1.Видимость = Ложь;
		Элементы.Группа2.Видимость = Ложь;
		Элементы.УведомленияОбщийСписок.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВидОтображения1ПриИзменении(Элемент)
	ИзменитьВидОтчета();
	ЗаполнитьСписокУведомлений(ТЗ);
КонецПроцедуры

ТЗ = Новый ТаблицаЗначений;
